In [73]:
# input pakges
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

## pandas 数据结构

In [4]:
# Series：包含一个值序列，并且包含数据标签（索引index）
obj = pd.Series([1, 2, 3, 4])
# 索引为0-(N-1)
obj

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
# 获得索引
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [46]:
# 创建单独的索引序列
obj2 = pd.Series([-1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
# 在自身改变
obj.index = ['w', 'b', 'c', 'd']
print(obj)
print(obj2)

w    1
b    2
c    3
d    4
dtype: int64
a   -1
b    2
c    3
d    4
dtype: int64

In [51]:
# Series 的name属性
obj2.name = 'data'
print(obj2)
obj2.index.name = 'state'
print(obj2)

state
a   -1
b    2
c    3
d    4
Name: data, dtype: int64
state
a   -1
b    2
c    3
d    4
Name: data, dtype: int64

array([-1,  2,  3,  4])

In [12]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [48]:
obj2.values

array([-1,  2,  3,  4])

In [13]:
obj2['d']

4

In [14]:
obj2[obj2 > 2]

c    3
d    4
dtype: int64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [24]:
sdata = {'aa': 100, 'ww':12, 'ee': 13, 'qq':10}
sdata

{'aa': 100, 'ww': 12, 'ee': 13, 'qq': 10}

In [25]:
obj3 = pd.Series(sdata)
obj3

aa    100
ww     12
ee     13
qq     10
dtype: int64

In [29]:
# 你可以根据索引文件找对应的值
states = ['ff', 'aa', 'qq', 'ee']
obj4 = pd.Series(sdata, index=states)
obj4

ff      NaN
aa    100.0
qq     10.0
ee     13.0
dtype: float64

In [31]:
# isnull和notnull来检查缺失值
pd.isnull(obj4)

ff     True
aa    False
qq    False
ee    False
dtype: bool

In [32]:
pd.notnull(obj4)

ff    False
aa     True
qq     True
ee     True
dtype: bool

In [79]:
data = {'aa': [100, 20, 10, 100, 20, 10], 'ww':[12, 19, 10, 12, 19, 10], 'ee': [13, 11, 10, 13, 11, 10]}
print(data)
frame = pd.DataFrame(data)
frame

{'aa': [100, 20, 10, 100, 20, 10], 'ww': [12, 19, 10, 12, 19, 10], 'ee': [13, 11, 10, 13, 11, 10]}

    aa  ww  ee
0  100  12  13
1   20  19  11
2   10  10  10
3  100  12  13
4   20  19  11
5   10  10  10

In [80]:
frame.head()

    aa  ww  ee
0  100  12  13
1   20  19  11
2   10  10  10
3  100  12  13
4   20  19  11

In [81]:
# add indexs, not in > get 'NaN'
frame2 = pd.DataFrame(data, columns=['ww', 'ee','aa', 'ff'])
frame2

   ww  ee   aa   ff
0  12  13  100  NaN
1  19  11   20  NaN
2  10  10   10  NaN
3  12  13  100  NaN
4  19  11   20  NaN
5  10  10   10  NaN

In [82]:
# get Series by the index or name, 后者只有在列表名有效时有用
print(frame['aa'])
print(frame.aa)

0    100
1     20
2     10
3    100
4     20
5     10
Name: aa, dtype: int64
0    100
1     20
2     10
3    100
4     20
5     10
Name: aa, dtype: int64

In [83]:
# the row datas are get by `loc` 
frame.loc[3]

aa    100
ww     12
ee     13
Name: 3, dtype: int64

In [84]:
frame2['ff'] = 1111
frame2

   ww  ee   aa    ff
0  12  13  100  1111
1  19  11   20  1111
2  10  10   10  1111
3  12  13  100  1111
4  19  11   20  1111
5  10  10   10  1111

In [85]:
frame2['ff'] = np.arange(6)
frame2

   ww  ee   aa  ff
0  12  13  100   0
1  19  11   20   1
2  10  10   10   2
3  12  13  100   3
4  19  11   20   4
5  10  10   10   5

In [86]:
val = pd.Series([1, 2, 3], index=[2, 4, 5])
frame2['dd'] = val
frame2

   ww  ee   aa  ff   dd
0  12  13  100   0  NaN
1  19  11   20   1  NaN
2  10  10   10   2  1.0
3  12  13  100   3  NaN
4  19  11   20   4  2.0
5  10  10   10   5  3.0

In [114]:
# get the same data of 'ww' and 'ee'
a = frame2['ww'] == frame2['ee']
frame2['ww'][a[a == True].index]

2    10
5    10
Name: ww, dtype: int64

In [116]:
frame2['gg'] = frame2.ww == 10
frame2

   ww  ee   aa  ff   dd     gg
0  12  13  100   0  NaN  False
1  19  11   20   1  NaN  False
2  10  10   10   2  1.0   True
3  12  13  100   3  NaN  False
4  19  11   20   4  2.0  False
5  10  10   10   5  3.0   True

In [117]:
del frame2['gg']

In [118]:
frame2.columns

Index(['ww', 'ee', 'aa', 'ff', 'dd'], dtype='object')

In [122]:
# 嵌套字典形式
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [124]:
# 转置计算
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6